# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Termianl Utilities
brew 'autojump'
brew 'jump'
brew 'thefuck'
brew 'mtr'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'openssl'
brew 'cmake'

# Development
brew 'vim'
brew 'elasticsearch'
brew 'gdbm'
brew 'heroku'
brew 'postgresql'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rabbitmq'
brew 'watchman'
brew 'yarn'


# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'shuttle'
cask 'github-desktop'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'dnscrypt'
cask 'spotifree'
cask 'spotify'
cask 'psequel'
cask 'unrarx'
cask 'skype'
cask 'telegram'
cask 'spectacle'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Gapplin', id: 768053424
mas 'Telegram', id: 747648890
mas 'Giphy Capture', id: 668208984
mas 'Flycut (Clipboard manager)', id: 442160987
